{"id":36217,"date":"2021-06-02T18:31:48","date_gmt":"2021-06-02T18:31:48","guid":{"rendered":"https:\/\/huemor.rocks\/our-secret-to-ada-site-compliance\/"},"modified":"2023-08-15T15:21:38","modified_gmt":"2023-08-15T15:21:38","slug":"our-secret-to-ada-site-compliance","status":"publish","type":"post","link":"https:\/\/huemor.rocks\/blog\/our-secret-to-ada-site-compliance\/","title":{"rendered":"Our Secret to WCAG and ADA Site Compliance"},"content":{"rendered":"\n<p>As a business, you make some decisions because they benefit your customers, while others are designed to protect your business legally. Building an ADA-compliant website falls into both categories.<\/p>\n\n\n\n<!--more-->\n\n\n\n<p>According to the CDC, <a href=\"https:\/\/www.cdc.gov\/ncbddd\/disabilityandhealth\/infographic-disability-impacts-all.html\" target=\"_blank\" rel=\"noopener\">more than 60 million Americans<\/a> live with some type of disability. That&#8217;s more than one in four adults. According to <a href=\"https:\/\/www.worldbank.org\/en\/topic\/disability#:~:text=Results-,One%20billion%20people%2C%20or%2015%25%20of%20the%20world's%20population%2C,million%20people%2C%20experience%20significant%20disabilities.\" target=\"_blank\" rel=\"noopener\">World Bank estimates<\/a>, that number rises to one billion around the world. Following relevant disability guidelines ensures that your website is as relevant and beneficial to them as it would be to any other potential customer or client.<\/p>\n\n\n\n<p>That&#8217;s one incentive. The Americans with Disabilities Act (ADA) also makes building an accessible website a legal necessity. While it doesn&#8217;t technically mention websites as part of its language, they have been deemed &#8220;places of public accommodations&#8221; under the law by a wide range of court rulings. Compliance is crucial to avoid potential lawsuits or settlements.<\/p>\n\n\n\n<p>Making your web content accessible, in turn, means following WCAG, which is short for Web Content Accessibility Guidelines. More specifically, <a href=\"https:\/\/www.w3.org\/WAI\/standards-guidelines\/wcag\/glance\/\" target=\"_blank\" rel=\"noopener\">WCAG 2.1<\/a> is a set of individual rules that ensure your website is accessible for users with any type of disability.<\/p>\n\n\n\n<p>So let&#8217;s dive in. Keep reading to learn not just why your business needs to care about ADA and WCAG but also how you can accomplish an ADA compliant site —with one option that might be simpler than you thought.<\/p>\n\n\n\n<div class=\"ChapterFullwidth\" style=\"background-image:url(\/wp-content\/uploads\/2023\/04\/galaxy_bgg.png);background-size:cover;background-position:center center;background-repeat:no-repeat\"><div class=\"ChapterFullwitdh-wrapper\"><div class=\"ChapterFullwitdh-form\">\n<a id=\"chapter1\"><\/a>\n<\/div><img decoding=\"async\" loading=\"lazy\" width=\"30px\" height=\"30px\" class=\"ChapterFullwitdh-icons_chapter\" src=\"\/wp-content\/uploads\/2023\/04\/solarSystem.png\"\/><h5 class=\"ChapterFullwitdh-chaptersectiontitle\">Chapter 1<\/h5><h2 class=\"ChapterFullwitdh-chaptertitle\">Why is ADA Compliance Important?<\/h2><\/div><\/div>\n\n\n\n<p>We&#8217;ll explain the basics, but there’s always more to learn. ADA compliance has serious business benefits, not in the least because a significant portion of your users will appreciate it.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">What is Website compliance?<\/h3>\n\n\n\n<p>First, we need to ask ourselves “What is website compliance?” Website compliance is described as “the state of observing and following all accessibility laws and regulations that apply to your website – should be an overall goal for your organization” by <a href=\"https:\/\/www.essentialaccessibility.com\/blog\/how-to-ensure-website-compliance-accessibility-standards#:~:text=Web%20compliance%20%E2%80%93%20the%20state%20of,overall%20goal%20for%20your%20organization.\" target=\"_blank\" rel=\"noopener\">Essential Accessibility.com<\/a>. One of these accessibility laws is Title II and Title III of the ADA which states that persons with disabilities cannot be discriminated against on the basis of their disability. By making your website and web content accessible this allows for equal access for all people.<\/p>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-vimeo wp-block-embed-vimeo wp-embed-aspect-18-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" src=\"https:\/\/player.vimeo.com\/video\/548848871?dnt=1&amp;app_id=122963\" width=\"500\" height=\"242\" frameborder=\"0\" allow=\"autoplay; fullscreen; picture-in-picture\"><\/iframe>\n<\/div><figcaption class=\"wp-element-caption\"><span style=\"font-size: 14px;\">Above is an example of our favorite ADA website compliance tool in action on our client Ag America&#8217;s website.<\/span><\/figcaption><\/figure>\n\n\n\n<h3 class=\"wp-block-heading\">Who does ADA Web Compliance Apply to?<\/h3>\n\n\n\n<p>Under Title III of the ADA concerns public businesses while under Title II it specifically describes accessible websites and public accommodation. Meaning businesses must be able to serve people with disabilities by providing them access to web content in accommodating ways.<\/p>\n\n\n\n<p>In terms of the World Wide Web, places of public accommodation would make businesses are responsible and to make sure their digital content follows best practices through the forms of mobile apps, webpages, any links, etc.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Is ADA Compliance Mandatory for Websites?<\/h3>\n\n\n\n<p>The technical answer to this question is “not necessarily” under federal, however, under local and state government there must be accessible websites. From both a legal and ethical point of view should offer web accessibility services through their websites as there are a number of benefits for doing so.<br>The best way of offering public accommodation is through following WCAG guidelines to create web accessibility for all. The success criteria will be shared later on but follow the guidelines laid out in WCAG 2.0 and WCAG 2.1 will help to make your website accessible and avoid legal action such as lawsuits.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">The User Benefits of Website Compliance<\/h3>\n\n\n\n<p>We&#8217;ve established already just how common disabilities actually are in the general population. Millions of people might have trouble recognizing certain colors, reading small type, or seeing any of your visual content. Others might have limited use of their hands, increasing their difficulty to navigate around your site.<\/p>\n\n\n\n<p>The general term for software that helps these users navigate the web is typically called assistive technology. It can include a wide range of platforms, including:<\/p>\n\n\n\n<ul>\n<li>Screen readers<\/li>\n\n\n\n<li>Eye tracking tools<\/li>\n\n\n\n<li>Automatic contrast adjustments<\/li>\n\n\n\n<li>Speech recognition software<\/li>\n\n\n\n<li>And much more.<\/li>\n<\/ul>\n\n\n\n<p>Globally, this is a <a href=\"https:\/\/www.businesswire.com\/news\/home\/20200713005395\/en\/Global-Disabled-and-Elderly-Assistive-Technology-Industry-2020-to-2027---Market-Trajectory-Analytics---ResearchAndMarkets.com\" target=\"_blank\" rel=\"noopener\">$21 billion industry<\/a> that is expected to top $31 billion by 2027. The rapid growth is only natural, considering how increasingly important the internet has become around the globe.<\/p>\n\n\n\n<p>We&#8217;ll get into the exact question of what makes an ADA accessible website below. For now, the most important takeaway is that a website following WCAG and ADA guidelines is specifically designed for all common disabilities, and the technology accommodating them. It ensures that your website is just as beneficial for them as it is for all other segments of your audience.<\/p>\n\n\n\n<p>Think about the opportunities that it brings, depending on the audience you target. A retailer targeting older populations might improve the online experience of more than 50% of its audience. But even a beauty brand, whose audience might skew younger, will still encounter users with disabilities who will appreciate the accommodations.<\/p>\n\n\n\n<p>In short, visitors will appreciate a user interface that accommodates their needs, rather than forcing them to adjust to yours.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">The Business Benefits of ADA Compliance<\/h3>\n\n\n\n<p>Those user benefits above, of course, are not purely philanthropic. Through making your website accessible by accommodating the needs of audiences with disabilities, you unlock the goodwill and purchase ability of one quarter of your target audience. That figure rises significantly depending on your target audience&#8217;s demographics.<\/p>\n\n\n\n<p>This is an audience with an estimated disposable income above $600 billion. Its goodwill can easily translate to increased revenues for your business.<br>The connection between user and business advantages, as outlined above, is natural. But ADA compliance benefits your business even beyond happier, more approachable page visitors.<\/p>\n\n\n\n<p>The most obvious business benefit is avoiding legal jeopardy, such as violating Title III. According to one analysis, 2019 saw <a href=\"https:\/\/www.adatitleiii.com\/2020\/02\/2019-was-another-record-breaking-year-for-federal-ada-title-iii-lawsuits\/\" target=\"_blank\" rel=\"noopener\">more than 11,000 lawsuits<\/a> related to ADA Title III violations. Over the past five years, that number has grown by an average of more than 20%.<\/p>\n\n\n\n<p>It&#8217;s not just large or small businesses, either. Brands as well-known as Domino&#8217;s and the Golden State Warriors have been sued because their websites weren&#8217;t ADA accessible in recent years.<\/p>\n\n\n\n<p>Finally, it&#8217;s a reputation issue. A lawsuit, or even a reputation for not sufficiently catering to audiences with unique needs can be as harmful as a reputation for the opposite can be beneficial. Especially in highly regulated industries of public-private partnerships, ADA compliance becomes a business benefit and potential differentiator from your competition.<\/p>\n\n\n\n<p>So much for the why. Next, we&#8217;ll explore the how of creating site-wide ADA compliance.<\/p>\n\n\n\n<div class=\"huemorProtip-container\" style=\"background-image:url(null);background-size:cover;background-position:center;background-repeat:no-repeat\"><h2 class=\"huemorProtip-title\" style=\"color:black\">Free Demo<\/h2><p style=\"color:black\" class=\"huemorProtip-description\">Get a free demo to AccessiBe, our preferred ADA compliance tool for websites.<\/p><div class=\"huemorProtip-button\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https:\/\/accessibe.com\/a\/pp4fivl\" target=\"_blank\" rel=\"noreferrer noopener\">Get Your Free Demo<\/a><\/div>\n<\/div><\/div>\n\n\n\n<h5 class=\"wp-block-heading\" id=\"chapter2\">&nbsp;<\/h5>\n\n\n\n<div class=\"ChapterFullwidth\" style=\"background-image:url(\/wp-content\/uploads\/2023\/04\/galaxy_bgg.png);background-size:cover;background-position:center center;background-repeat:no-repeat\"><div class=\"ChapterFullwitdh-wrapper\"><div class=\"ChapterFullwitdh-form\">\n<a id=\"chapter2\"><\/a>\n<\/div><img decoding=\"async\" loading=\"lazy\" width=\"30px\" height=\"30px\" class=\"ChapterFullwitdh-icons_chapter\" src=\"\/wp-content\/uploads\/2023\/04\/solarSystem.png\"\/><h5 class=\"ChapterFullwitdh-chaptersectiontitle\">Chapter 2<\/h5><h2 class=\"ChapterFullwitdh-chaptertitle\">What, Exactly, Makes Your Websites ADA-Compliant?<\/h2><\/div><\/div>\n\n\n\n<p>In almost every instance, lawsuits and judges, as well as the U.S. Department of Justice, have all pointed to a simple way to make sure that your webpages are ADA compliant: follow the WCAG guidelines.<\/p>\n\n\n\n<p>So let&#8217;s dig in. First published by the University of Wisconsin-Madison, they&#8217;ve been continually updated to account for new research, web developments, and the current digital landscape. The most recent WCAG 2.1 prompts websites to follow guidelines in 4 categories, with the acronym POUR:<\/p>\n\n\n\n<ul>\n<li>Perceivable<\/li>\n\n\n\n<li>Operable<\/li>\n\n\n\n<li>Understandable<\/li>\n\n\n\n<li>Robust<\/li>\n<\/ul>\n\n\n\n<div class=\"huemorProtip-container\" style=\"background-image:url(null);background-size:cover;background-position:center;background-repeat:no-repeat\"><h2 class=\"huemorProtip-title\" style=\"color:black\">Protip<\/h2><p style=\"color:black\" class=\"huemorProtip-description\">Each of them deserves further explanation. We have actionable tips from the <a href=\"https:\/\/www.w3.org\/WAI\/standards-guidelines\/wcag\/glance\/\" target=\"_blank\" rel=\"noreferrer noopener\">WCAG&#8217;s quick guide<\/a> to achieve success in each category<\/p><div class=\"huemorProtip-button\"><\/div><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">Perceivable<\/h3>\n\n\n\n<p>Users with disabilities should be able to experience your webpages to its fullest success criteria. They might not be able to see the text, images, or video, so it&#8217;s all about providing alternative ways to consume your website&#8217;s individual pages.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">How to Make Your Websites Perceivable<\/h4>\n\n\n\n<ul>\n<li>Create ALT text for any non-text content on your site. That ALT text should describe the media in simple words.<\/li>\n\n\n\n<li>Anytime multimedia like video appears on your site, provide captions for users with hearing disabilities.<\/li>\n\n\n\n<li>Create your text in a way that accounts for assistive technologies like screen readers. That includes actions like following a predictable intro-text-conclusion structure and avoiding text on images.<\/li>\n\n\n\n<li>Use color as a nonessential design choice, ensuring that color-blind users can still navigate your site. For instance, a green button is not enough to convey &#8216;go&#8217; without the word &#8216;go&#8217;.<\/li>\n<\/ul>\n\n\n\n<p>Ensure that audio playing on your site is nonessential and can be controlled rather than auto-playing on your website.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Operable<\/h3>\n\n\n\n<p>This principle is simple: all users, regardless of any devices they might use, should be able to navigate your website and all features you have to offer them. In other words, no part of your UI should negatively impact UX, regardless of disabilities or assistive technologies used.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">How to Make Your Websites Operable<\/h4>\n\n\n\n<ul>\n<li>Make sure that your website can be navigated with only a keyboard.<br>Make sure that alternative inputs, like voice recognition or mouse only, are just as smooth.<\/li>\n\n\n\n<li>Give users enough time to read and consume the content, avoiding tight time limits or fast autoscrolling.<\/li>\n\n\n\n<li>Avoid any content that could cause seizures or audiovisual confusion.<\/li>\n\n\n\n<li>Provide navigation assistance, through intuitive menus and alternative ways to navigate (such as an internal site search).<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Understandable<\/h3>\n\n\n\n<p>This one is self-explanatory. Users with disabilities should be able to understand all content on your website as anyone else would. That includes both the main content and any instructions for additional tools on your site such as your navigation, search, or forms.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">How to Make Your Websites Understandable<\/h4>\n\n\n\n<ul>\n<li>Clarify the language of any page in its header HTML tag.<br>Avoid overuse of unusual terms such as jargon and idioms, which assistive technology may not be able to identify.<\/li>\n\n\n\n<li>Make your content and navigation predictable, keeping it consistent throughout your website.<\/li>\n<\/ul>\n\n\n\n<p>Use labels, instructions, and error correction tools to help users with disabilities avoid and correct both their own mistakes and website errors.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Robust<\/h3>\n\n\n\n<p>Finally, an ADA-compliant website is robust in that it creates the same comprehensive experience for users with disabilities who need assistive technologies as it would for anyone else. In other words, compatibility with any tools a portion of your visitors might use is key to be compliant within this section.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">How to Make Your Websites Robust<\/h4>\n\n\n\n<ul>\n<li>Optimize HTML and any markup languages to create complete tags, avoid duplicates, and keep ID&#8217;s unique.<\/li>\n\n\n\n<li>Ensure that all UI components have names and roles that can be determined programmatically and directly in the code.<\/li>\n\n\n\n<li>Use status messages to provide feedback when users take sufficient action, such as a “success” message when someone fills out a form.<\/li>\n<\/ul>\n\n\n\n<p>Combine all techniques within the POUR acronym, and you get quite the complex web of needs to be truly WCAG 2.1 and ADA-compliant. The complete guide on the <a href=\"https:\/\/www.w3.org\/WAI\/WCAG21\/quickref\/?showtechniques=413#principle1\" target=\"_blank\" rel=\"noopener\">WCAG website provides examples<\/a> and tips for each of the 50+ individual guidelines within those four overarching categories.<\/p>\n\n\n\n<h5 class=\"wp-block-heading\" id=\"chapter3\">&nbsp;<\/h5>\n\n\n\n<div class=\"ChapterFullwidth\" style=\"background-image:url(\/wp-content\/uploads\/2023\/04\/galaxy_bgg.png);background-size:cover;background-position:center center;background-repeat:no-repeat\"><div class=\"ChapterFullwitdh-wrapper\"><div class=\"ChapterFullwitdh-form\">\n<a id=\"chapter3\"><\/a>\n<\/div><img decoding=\"async\" loading=\"lazy\" width=\"30px\" height=\"30px\" class=\"ChapterFullwitdh-icons_chapter\" src=\"\/wp-content\/uploads\/2023\/04\/solarSystem.png\"\/><h5 class=\"ChapterFullwitdh-chaptersectiontitle\">Chapter 3<\/h5><h2 class=\"ChapterFullwitdh-chaptertitle\">Introducing Our Secret Weapon for ADA Compliance<\/h2><\/div><\/div>\n\n\n\n<p>You might be forgiven for getting just a bit nervous after reading the previous section. After all, one thing is clear: ADA website compliance is not an easy thing to accomplish. Done manually, it can consume your entire web development budget and resources—and even then, you still might miss a few steps and remain in legal jeopardy.<\/p>\n\n\n\n<p>Fortunately, it doesn&#8217;t need to be a manual process. Allow us to introduce our secret weapon: <a href=\"https:\/\/accessibe.com\/\" target=\"_blank\" rel=\"noopener\">AccessiBe<\/a>, an accessibility tool that can make your website ADA compliant much more dynamically.<\/p>\n\n\n\n<p>Gal Vizel, AccessiBe’s CEO spoke of his company in saying &#8220;We know that business owners do not knowingly want to leave their consumers out, not from their shops and not from their websites. AccessiBe makes website accessibility achievable for websites of all sizes so that people with disabilities can have access to a wider range of services, goods, products, and opportunities. We&#8217;re bridging the website accessibility gap, getting people with disabilities closer to the reality of an accessible web and to be able to use the web the way it was intended.&#8221;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">What is AccessiBe?<\/h3>\n\n\n\n<p>The tool is simple: one line of JavaScript, added to your website. Once there, your website gains an accessibility interface that users with disabilities can use for features like zooming in, reading the screen, and enabling keyboard-based navigation.<\/p>\n\n\n\n<p>It&#8217;s a simple icon that users can click on to expand. Of course, that icon can be customized in both colors and placement to conform to your brand and website layout. From there, the interface helps any users with disabilities more easily navigate and experience your site.<\/p>\n\n\n\n<p>That interface, though, is only the start of a more accessible experience. The rest happens in the background, with an automatic AI-based scan of your website that catches and corrects errors on an ongoing basis. Within 48 hours, your website is accessible and compliant —and it will stay that way as long as the tool is installed in your code.<\/p>\n\n\n\n<p>AccessiBe&#8217;s goal is to make the entire internet accessible for users with disabilities by 2025. It&#8217;s ambitious, but based on this tool&#8217;s capabilities, it doesn&#8217;t seem out of the realm of possibility.<\/p>\n\n\n\n<div class=\"ChapterFullwidth\" style=\"background-image:url(\/wp-content\/uploads\/2023\/04\/galaxy_bgg.png);background-size:cover;background-position:center center;background-repeat:no-repeat\"><div class=\"ChapterFullwitdh-wrapper\"><div class=\"ChapterFullwitdh-form\">\n<a id=\"chapter4\"><\/a>\n<\/div><img decoding=\"async\" loading=\"lazy\" width=\"30px\" height=\"30px\" class=\"ChapterFullwitdh-icons_chapter\" src=\"\/wp-content\/uploads\/2023\/04\/solarSystem.png\"\/><h5 class=\"ChapterFullwitdh-chaptersectiontitle\">Chapter 4<\/h5><h2 class=\"ChapterFullwitdh-chaptertitle\">How AccessiBe Can Help Your Website Succeed<\/h2><\/div><\/div>\n\n\n\n<p>Now, here’s how you get things started. AccessiBe can help your website get and stay compliant within the POUR acronym described above.<\/p>\n\n\n\n<ul>\n<li>Perceivable: the tool scans your website and adds ALT text to any images missing it. It can also provide captions and, through its integrated screen reader, optimize text to match it.<\/li>\n\n\n\n<li>Operable: the tool optimizes and completes coding to allow for alternative inputs, including the correct tagging of links, popups, navigational menus, and more.<\/li>\n\n\n\n<li>Understandable: Navigation and labels get fixed up in the code of the site itself, and jargon and technical terms are flagged as needed.<\/li>\n\n\n\n<li>Robust: the tool&#8217;s contextual machine learning allows for continuous optimization of HTML within the site, including correction of labels of any core UI components.<\/li>\n<\/ul>\n\n\n\n<p>AccessiBe&#8217;s <a href=\"https:\/\/accessibe.com\/product\/artificial-intelligence\" target=\"_blank\" rel=\"noopener\">artificial intelligence page<\/a> further explains the process and various ways it can help you become and remain compliant with all relevant accessibility guidelines. The result is a truly optimized website that ultimately improves your user interface experience, regardless of its needs and challenges.<\/p>\n\n\n\n<h5 class=\"wp-block-heading\" id=\"chapter5\">&nbsp;<\/h5>\n\n\n\n<div class=\"ChapterFullwidth\" style=\"background-image:url(\/wp-content\/uploads\/2023\/04\/galaxy_bgg.png);background-size:cover;background-position:center center;background-repeat:no-repeat\"><div class=\"ChapterFullwitdh-wrapper\"><div class=\"ChapterFullwitdh-form\">\n<a id=\"chapter5\"><\/a>\n<\/div><img decoding=\"async\" loading=\"lazy\" width=\"30px\" height=\"30px\" class=\"ChapterFullwitdh-icons_chapter\" src=\"\/wp-content\/uploads\/2023\/04\/solarSystem.png\"\/><h5 class=\"ChapterFullwitdh-chaptersectiontitle\">Chapter 5<\/h5><h2 class=\"ChapterFullwitdh-chaptertitle\">Next Steps to an ADA-Compliant Website<\/h2><\/div><\/div>\n\n\n\n<p>So much for our secret weapon. But what, exactly, should you do to truly reach ADA site compliance? We suggest a few core steps that can help you get there:<\/p>\n\n\n\n<ul>\n<li>Complete a <a href=\"https:\/\/ace.accessibe.com\/\" target=\"_blank\" rel=\"noopener\">site accessibility audit<\/a>. That gives you a great idea of where your business stands and where your website needs improvements.<\/li>\n\n\n\n<li>Research the Americans with Disabilities Act (ADA) and WCAG trends in your industry. While this guide works great as an introduction, plenty of industry and audience-specific nuances exist. The more familiar you are with them, the better.Talk to your legal team. Whether you have your own legal department or work with an external lawyer, an expert can give you a good perspective on the importance of ADA compliance.<\/li>\n\n\n\n<li>Look for a website partner. Especially if going through the process on your own is daunting, finding a partner can go a long way towards calming your worries.<\/li>\n\n\n\n<li>Leverage the right tools (Yep, this is where we mention AccessiBe again.) Knowing the tools at your disposal can help you act quickly to make your website accessible.<\/li>\n<\/ul>\n\n\n\n<p>Ultimately, ADA compliance benefits everyone. It improves your website&#8217;s user experience and unlocks a significant part of your target audience. As a result, your potential revenue and profitability rises accordingly. And of course, you ease the worries of company leadership by decreasing legal liabilities, while simultaneously improving your reputation as an accessible, compliant business.<br>And, once you break it down, it&#8217;s not as daunting as it appears at first. At the end of the day, you’ll likely feel similar to countless other businesses addressing this demand. You&#8217;ll want to make your website&#8217;s ADA-compliance a priority.<\/p>\n\n\n\n<div class=\"huemorProtip-container\" style=\"background-image:url(null);background-size:cover;background-position:center;background-repeat:no-repeat\"><h2 class=\"huemorProtip-title\" style=\"color:black\">Free Demo<\/h2><p style=\"color:black\" class=\"huemorProtip-description\">Get a free demo to AccessiBe, our preferred ADA compliance tool for websites.<\/p><div class=\"huemorProtip-button\">\n<div class=\"wp-block-button\"><a class=\"wp-block-button__link wp-element-button\" href=\"https:\/\/accessibe.com\/a\/pp4fivl\" target=\"_blank\" rel=\"noreferrer noopener\">Get Your Free Demo<\/a><\/div>\n<\/div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Find out our secret to following the Web Content Accessibility Guidelines (WCAG) and the Americans with Disabilities Act (ADA).<\/p>\n","protected":false},"author":9,"featured_media":42432,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"content-type":""},"categories":[35,30],"tags":[29],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v20.9 (Yoast SEO v20.13) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Our Secret to WCAG and ADA Site Compliance - Jorban<\/title>\n<meta name=\"description\" content=\"Find out our secret to following the Web Content Accessibility Guidelines (WCAG) and the Americans with Disabilities Act (ADA).\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/huemor.rocks\/blog\/our-secret-to-ada-site-compliance\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Our Secret to WCAG and ADA Site Compliance - Jorban\" \/>\n<meta property=\"og:description\" content=\"Find out our secret to following the Web Content Accessibility Guidelines (WCAG) and the Americans with Disabilities Act (ADA).\" \/>\n<meta property=\"og:url\" content=\"https:\/\/huemor.rocks\/blog\/our-secret-to-ada-site-compliance\/\" \/>\n<meta property=\"og:site_name\" content=\"Huemor\" \/>\n<meta property=\"article:published_time\" content=\"2021-06-02T18:31:48+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-08-15T15:21:38+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/huemor.rocks\/wp-content\/uploads\/2021\/06\/2023.04.04.Our-Secret-to-WCAG-and-ADA-Site-Compliance.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1025\" \/>\n\t<meta property=\"og:image:height\" content=\"867\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Ahmad Jorban\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@HuemorDesigns\" \/>\n<meta name=\"twitter:site\" content=\"@HuemorDesigns\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Ahmad Jorban\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/huemor.rocks\/blog\/our-secret-to-ada-site-compliance\/\",\"url\":\"https:\/\/huemor.rocks\/blog\/our-secret-to-ada-site-compliance\/\",\"name\":\"Our Secret to WCAG and ADA Site Compliance - Jorban\",\"isPartOf\":{\"@id\":\"https:\/\/huemor.rocks\/#website\"},\"datePublished\":\"2021-06-02T18:31:48+00:00\",\"dateModified\":\"2023-08-15T15:21:38+00:00\",\"author\":{\"@id\":\"https:\/\/huemor.rocks\/#\/schema\/person\/de86670ca16bf41a35b3f0c914f75893\"},\"description\":\"Find out our secret to following the Web Content Accessibility Guidelines (WCAG) and the Americans with Disabilities Act (ADA).\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/huemor.rocks\/blog\/our-secret-to-ada-site-compliance\/\"]}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/huemor.rocks\/#website\",\"url\":\"https:\/\/huemor.rocks\/\",\"name\":\"Huemor\",\"description\":\"Award-Winning Web Agency, based in USA\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/huemor.rocks\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/huemor.rocks\/#\/schema\/person\/de86670ca16bf41a35b3f0c914f75893\",\"name\":\"Ahmad Jorban\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/huemor.rocks\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/12f6535a8d7adc5a7ffc81ec45a5f070?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/12f6535a8d7adc5a7ffc81ec45a5f070?s=96&d=mm&r=g\",\"caption\":\"Ahmad Jorban\"},\"description\":\"Ahmad Jorban is the President of Jorbanwhere he helps plan the long-term strategic growth of the agency. Jeff is passionate about UI\/UX, demand generation, and digital strategy.\",\"sameAs\":[\"https:\/\/www.linkedin.com\/in\/jeffrey-gapinski\/\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Our Secret to WCAG and ADA Site Compliance - Jorban","description":"Find out our secret to following the Web Content Accessibility Guidelines (WCAG) and the Americans with Disabilities Act (ADA).","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/huemor.rocks\/blog\/our-secret-to-ada-site-compliance\/","og_locale":"en_US","og_type":"article","og_title":"Our Secret to WCAG and ADA Site Compliance - Jorban","og_description":"Find out our secret to following the Web Content Accessibility Guidelines (WCAG) and the Americans with Disabilities Act (ADA).","og_url":"https:\/\/huemor.rocks\/blog\/our-secret-to-ada-site-compliance\/","og_site_name":"Huemor","article_published_time":"2021-06-02T18:31:48+00:00","article_modified_time":"2023-08-15T15:21:38+00:00","og_image":[{"width":1025,"height":867,"url":"https:\/\/huemor.rocks\/wp-content\/uploads\/2021\/06\/2023.04.04.Our-Secret-to-WCAG-and-ADA-Site-Compliance.jpg","type":"image\/jpeg"}],"author":"Ahmad Jorban","twitter_card":"summary_large_image","twitter_creator":"@HuemorDesigns","twitter_site":"@HuemorDesigns","twitter_misc":{"Written by":"Ahmad Jorban","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/huemor.rocks\/blog\/our-secret-to-ada-site-compliance\/","url":"https:\/\/huemor.rocks\/blog\/our-secret-to-ada-site-compliance\/","name":"Our Secret to WCAG and ADA Site Compliance - Jorban","isPartOf":{"@id":"https:\/\/huemor.rocks\/#website"},"datePublished":"2021-06-02T18:31:48+00:00","dateModified":"2023-08-15T15:21:38+00:00","author":{"@id":"https:\/\/huemor.rocks\/#\/schema\/person\/de86670ca16bf41a35b3f0c914f75893"},"description":"Find out our secret to following the Web Content Accessibility Guidelines (WCAG) and the Americans with Disabilities Act (ADA).","inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/huemor.rocks\/blog\/our-secret-to-ada-site-compliance\/"]}]},{"@type":"WebSite","@id":"https:\/\/huemor.rocks\/#website","url":"https:\/\/huemor.rocks\/","name":"Huemor","description":"Award-Winning Web Agency, based in USA","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/huemor.rocks\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/huemor.rocks\/#\/schema\/person\/de86670ca16bf41a35b3f0c914f75893","name":"Ahmad Jorban","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/huemor.rocks\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/12f6535a8d7adc5a7ffc81ec45a5f070?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/12f6535a8d7adc5a7ffc81ec45a5f070?s=96&d=mm&r=g","caption":"Ahmad Jorban"},"description":"Ahmad Jorban is the President of Jorbanwhere he helps plan the long-term strategic growth of the agency. Jeff is passionate about UI\/UX, demand generation, and digital strategy.","sameAs":["https:\/\/www.linkedin.com\/in\/jeffrey-gapinski\/"]}]}},"_links":{"self":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/posts\/36217"}],"collection":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/comments?post=36217"}],"version-history":[{"count":3,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/posts\/36217\/revisions"}],"predecessor-version":[{"id":43738,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/posts\/36217\/revisions\/43738"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/media\/42432"}],"wp:attachment":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/media?parent=36217"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/categories?post=36217"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/tags?post=36217"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}