{"id":36249,"date":"2017-12-18T17:35:10","date_gmt":"2017-12-18T17:35:10","guid":{"rendered":"https:\/\/huemor.rocks\/web-design-vs-web-development\/"},"modified":"2023-07-11T20:08:57","modified_gmt":"2023-07-11T20:08:57","slug":"web-design-vs-web-development","status":"publish","type":"post","link":"https:\/\/huemor.rocks\/blog\/web-design-vs-web-development\/","title":{"rendered":"Understanding Web Design Vs Web Development"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What is the difference between web design and web development?<\/h2>\n\n\n\n<p>Oftentimes the terms “web design” and “<a href=\"https:\/\/huemor.rocks\/services\/web-development\/\" target=\"_blank\" rel=\"noreferrer noopener\">web development<\/a>” are used interchangeably. This can create breakdowns in communication and prohibit clients and web design companies from having effective conversations. Especially during the process of effectively planning a <a href=\"https:\/\/huemor.rocks\/services\/website-redesigns\/\" target=\"_blank\" rel=\"noreferrer noopener\">website redesign<\/a>.<\/p>\n\n\n\n<!--more-->\n\n\n\n<p>In this article, we’ll be discussing web design vs web development, the roles of web designers vs web developers, and how to keep the terms straight.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<div class=\"ChapterFullwidth\" style=\"background-image:url(\/wp-content\/uploads\/2023\/04\/galaxy_bgg.png);background-size:cover;background-position:center center;background-repeat:no-repeat\"><div class=\"ChapterFullwitdh-wrapper\"><div class=\"ChapterFullwitdh-form\">\n<a id=\"chapter1\"> <\/a>\n<\/div><img decoding=\"async\" loading=\"lazy\" width=\"30px\" height=\"30px\" class=\"ChapterFullwitdh-icons_chapter\" src=\"\/wp-content\/uploads\/2023\/04\/solarSystem.png\"\/><h5 class=\"ChapterFullwitdh-chaptersectiontitle\">CHAPTER ONE<\/h5><h2 class=\"ChapterFullwitdh-chaptertitle\">What is Web Design and Development?<\/h2><\/div><\/div>\n\n\n\n<p>Whether you have an <a href=\"https:\/\/huemor.rocks\/services\/ecommerce-website-design\/\" target=\"_blank\" rel=\"noreferrer noopener\">ecommerce store<\/a>, an informational site, a <a href=\"https:\/\/huemor.rocks\/b2b-corporate-websites\/\" target=\"_blank\" rel=\"noreferrer noopener\">B2B services website<\/a>, or a SaaS website, user-friendly website design and great web development are equally important.<\/p>\n\n\n\n<ol>\n<li>Web design attends to the branding, layout, features, colors, fonts, and visual elements of a website: its “look and feel.”<\/li>\n\n\n\n<li>Web development attends to all of the processes happening behind the scenes that make the website possible.<\/li>\n<\/ol>\n\n\n\n<p>Let’s start with an analogy.<\/p>\n\n\n\n<p>You’ve got yourself a stunning dark grey Jaguar E-Type with all the bells and whistles. It&#8217;s a pretty car – but it&#8217;s more than that. The aesthetic speaks to you. The lines, the materials, the logo. It all seems to be<em> just right.<\/em><\/p>\n\n\n\n<p>You slide into the leather driver’s seat and prepare to take to the open road. You turn the key and hear your engine roar. A feeling reverberates through you. You&#8217;re off, enjoying a spring afternoon with the roof down – life is good.<\/p>\n\n\n\n<p>In this metaphor, web design is the <em>look and feel<\/em>, and web development is <em>the engine<\/em>.<\/p>\n\n\n\n<p>You need both to be top-notch in order to deliver an excellent driving experience.<\/p>\n\n\n\n<p>Now, with the understanding of &#8220;design&#8221; as being the look and feel, and &#8220;development&#8221; being the engine, let&#8217;s take a deeper dive into the individuals in each role.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<div class=\"ChapterFullwidth\" style=\"background-image:url(\/wp-content\/uploads\/2023\/04\/galaxy_bgg.png);background-size:cover;background-position:center center;background-repeat:no-repeat\"><div class=\"ChapterFullwitdh-wrapper\"><div class=\"ChapterFullwitdh-form\">\n<a id=\"chapter2\"> <\/a>\n<\/div><img decoding=\"async\" loading=\"lazy\" width=\"30px\" height=\"30px\" class=\"ChapterFullwitdh-icons_chapter\" src=\"\/wp-content\/uploads\/2023\/04\/solarSystem.png\"\/><h5 class=\"ChapterFullwitdh-chaptersectiontitle\">CHAPTER two<\/h5><h2 class=\"ChapterFullwitdh-chaptertitle\">Web Designer vs Web Developer: What&#8217;s the Difference?<\/h2><\/div><\/div>\n\n\n\n<h3 class=\"wp-block-heading\">The Role of a Web Designer<\/h3>\n\n\n\n<p>It’s understandable why people are confused by the term “web designer”. The role of a web designer has evolved quite a bit, often blurring the lines between web designer and web developer. In general, web designers (often referred to as UI designers or UX designers) spearhead the user experience planning and visual aspects of your web pages.<\/p>\n\n\n\n<p>Web designers plan the overall visual elements and site structure, as well as focus on a color palette, typography, layout, and images. Web design governs what the user will ultimately see on their device when they arrive at your site. It’s also the main driver of business goals, such as <a href=\"https:\/\/huemor.rocks\/blog\/lead-generation-resources-for-b2b-websites\/\" target=\"_blank\" rel=\"noreferrer noopener\">generating more leads<\/a> or improving online sales. Some website designers even cross over into adjacent skills such as product design, which is always a plus for an online store.<\/p>\n\n\n\n<p>The designer&#8217;s role is to keep an overall consistency (repetition or rhythm) of the entire site, so it doesn’t feel like every page belongs to a different site entirely. A design principle like the unity in the layout or a color theory helps the human brain organize the information they are processing on the site.<\/p>\n\n\n\n<p>Web designers stick to a theme for the site that speaks to the target audience, and finds relevant images for the subject matter, ensuring no inconsistencies. The web design is the first impression a visitor will get of the brand, and if they like the user interface UI design, they might stay around longer to explore the product or service offerings.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Summarizing A Web Designer’s Personality<\/h4>\n\n\n\n<p>UX designers view, interact and visually process the world. If they were to give you directions to their home, they would most likely describe the physical landmarks you would pass on your way.<\/p>\n\n\n\n<p>They rely strongly on their intuition. They are driven by how they ‘feel’ about something when creating the closer look and feel of their designs.<\/p>\n\n\n\n<p>Trade in ‘big ideas.’ A user interface UI designer can visualize every aspect of the user experience, the overall ‘vibe’ of the website along with every component that contributes to making the whole.<\/p>\n\n\n\n<p>There are different types of web designers, but they all share some common skill sets:<\/p>\n\n\n\n<ul>\n<li>Trust their gut instincts<\/li>\n\n\n\n<li>Ability to speak in front of a crowd<\/li>\n\n\n\n<li>Make decisions based on social considerations<\/li>\n\n\n\n<li>Express emotions easily<\/li>\n\n\n\n<li>Flourish with out-of-the-box thinking<\/li>\n\n\n\n<li>Doesn’t like too much structure or following ‘norms’<\/li>\n\n\n\n<li>Sees structure as a limitation to creativity<\/li>\n\n\n\n<li>Entrepreneurs<\/li>\n\n\n\n<li>A knack for knowing what people want<\/li>\n\n\n\n<li>Expressive extrovert artistic masters<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">The Role of a Web Developer<\/h3>\n\n\n\n<p>Web developers build websites. The first step in website development is planning and design. The role of a web developer is to create functional websites from the design created by a web designer. Once the planning and design process has been completed, web developers, often called programmers, step in and bring the vision to life.<\/p>\n\n\n\n<p>The design is non-interactive at this point, and the developer starts the engine and begins fueling the process towards an interactive user experience (UX). The web developer can use coding skills like HTML and CSS for the process or make use of coding languages like PHP. They can opt to use a CMS (content management system) like <a href=\"https:\/\/huemor.rocks\/services\/wordpress-websites\/\" target=\"_blank\" rel=\"noreferrer noopener\">WordPress<\/a> or <a href=\"https:\/\/huemor.rocks\/services\/shopify-website-design\/\" target=\"_blank\" rel=\"noreferrer noopener\">Shopify<\/a>, which allow the client to update and maintain their website without the need for a developer for every change or addition.<\/p>\n\n\n\n<p>There are two types of web developers working on a site’s functionality: front-end developers (client-side) and backend (service-side). You might find that some web designers are also proficient at front-end development, understanding the ins and outs of HTML, CSS, and JavaScript. These rare designers are also frontend web developers for all practical purposes.<\/p>\n\n\n\n<p>Web developers may convert a static layout into a dynamic website by using image and content sliders, active states for links and buttons, and other interactive elements.<\/p>\n\n\n\n<p>The backend developer has a specific knowledge of a programming language like Python, Django, or Ruby on Rails, and also understands databases and the core structure of a site. The full stack developer is one who has skill sets both in front-end development and back-end web development. They are the code masters who jumpstart the design into an operating website.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h4 class=\"wp-block-heading\">Summarizing A Web Developer’s Mentality<\/h4>\n\n\n\n<p>The stereotypical image of the average web developer is a shy, anti-social introvert. But many developers defy these labels and display extrovert tendencies. Here is a list of the more traditional generalizations about the personality of web developers:<\/p>\n\n\n\n<ul>\n<li>Logical<\/li>\n\n\n\n<li>Scientific<\/li>\n\n\n\n<li>Analytical<\/li>\n\n\n\n<li>Obsessed with data<\/li>\n\n\n\n<li>Black-and-white worldview<\/li>\n\n\n\n<li>Efficient<\/li>\n\n\n\n<li>Takes one step at a time<\/li>\n\n\n\n<li>Pays attention to details<\/li>\n\n\n\n<li>Thinking<\/li>\n\n\n\n<li>Structured – loves planning<\/li>\n\n\n\n<li>Achieves goals in a predictable way<\/li>\n\n\n\n<li>Relies upon tried and tested techniques to get the job done<\/li>\n\n\n\n<li>Slower to speak their mind<\/li>\n\n\n\n<li>Smart decision-makers, weighing up all the options before sharing it with the rest of the team<\/li>\n<\/ul>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Web Designers + Web Developers: How They Collaborate Throughout A Project<\/h3>\n\n\n\n<h4 class=\"wp-block-heading\">Project Planning &amp; Strategy<\/h4>\n\n\n\n<p>Devising an effective project strategy requires strong collaboration from both designers and developers.<\/p>\n\n\n\n<p>But before UX and UI designers start the creative process, there has to be a solid plan in place. For the planning phase, web designers have to understand their client’s website goals and objectives clearly before moving on to the next stage called Information Architecture (IA), which will ultimately impact and guide the design phase. UX designers begin by conducting user research, followed by developing personas and user flows which help to establish a style guide that will serve as a lighthouse throughout the project to ensure designs remain on track. These design skills are essential in order to ensure that the end result is visually appealing and easy to use.<\/p>\n\n\n\n<p>Web developers are expected to contribute to this process by outlining the technical requirements of the project, and sourcing technology that matches the challenge. Developers also work towards shaping the designer’s ideas based on the platform they’re using to solve the client challenge. With the right development tools, they can make a significant contribution to the success of the project.<\/p>\n\n\n\n<p>With both business and technical challenges identified, the designer can get down to the visual nuts and bolts of the website look.<\/p>\n\n\n\n<p>They’re working together on web development and web design to create a balanced layout with contrasting colors which will draw attention to critical areas of the website, like CTA’s. Emphasis is also used to highlight specific areas of the page. Designers are looking to keep an overall consistency (repetition or rhythm) of the entire site, so it doesn’t feel like every page belongs to a different site entirely. By using these web design tools, designers can create a cohesive web experience.<\/p>\n\n\n\n<p>After the designer has achieved unity in the layout, they will work with the developer to lay out a guideline that translates the visual information into specifics for the learned code for the front-end theming and back-end content management support.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Spotting a Unicorn: Can a Web Developer Be a Web Designer?<\/h3>\n\n\n\n<p>Aptly named a ‘unicorn’, a person who can do web development and design is highly sought-after.<\/p>\n\n\n\n<p>They are fluent in the language of both design and development, offering greater team communication and a workflow process that is smooth.<\/p>\n\n\n\n<p>However, just because they can do everything doesn’t mean that they should. Sometimes it’s great to have a unicorn involved in smaller projects where they can take the project from concept to mock-ups to front-end development on their own. For more significant projects, it might be more productive to have separate individuals taking on the different roles of developer or web designer.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">A Typical Project Breakdown<\/h3>\n\n\n\n<p>Alright, so how do these two different folks work together successfully? Let’s say there’s a client project for laundry app development. The designer\/UX would be focused on design fundamentals like interviewing potential customers, creating user personas, user flows, visual design and graphic design. The developer would be focused on the research required for technical specifications, back-end development, front-end development, web applications, software development, and technical quality assurance.&nbsp;<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Web Design Vs Web Development: The Take-Away<\/h3>\n\n\n\n<p>It is important to have a better understanding of web development and design, as well as the personality characteristics and the difference between web designers and web developers in order to create a successful website.<\/p>\n\n\n\n<p>These broad-stroke personality characteristics of web developers and web designers lean strongly towards stereotypes. We have definitely all met these individuals in the digital world.<\/p>\n\n\n\n<p>Although some of these are natural traits portrayed in the different jobs – some of these personality traits can be learned over time. They can be developed through educational input or nurtured by a mentor on the team.<\/p>\n\n\n\n<p>One doesn’t want to say that an introvert would not make a great designer because we have seen evidence that there are introverts in these positions and vice versa. The important thing is not whether someone is an introvert or an extrovert, but whether they have a passion for the career paths they have chosen. As long as an individual has a passion for the job of either developer or designer he\/she can excel in any role they choose.<\/p>\n\n\n\n<p>The strength of any team is always in their diversity of personalities, perspectives, and approach to work. While they often work together to create a successful web design or web development, they each bring their own unique skills and perspectives to the table. Knowing the mentality of web designers and web developers will help you better understand the landscape when you next decide to have a new website created for your company!<\/p>\n\n\n\n<p><\/p>\n\n\n\n<div class=\"ChapterFullwidth\" style=\"background-image:url(\/wp-content\/uploads\/2023\/04\/galaxy_bgg.png);background-size:cover;background-position:center center;background-repeat:no-repeat\"><div class=\"ChapterFullwitdh-wrapper\"><div class=\"ChapterFullwitdh-form\">\n<a id=\"chapter3\"> <\/a>\n<\/div><img decoding=\"async\" loading=\"lazy\" width=\"30px\" height=\"30px\" class=\"ChapterFullwitdh-icons_chapter\" src=\"\/wp-content\/uploads\/2023\/04\/solarSystem.png\"\/><h5 class=\"ChapterFullwitdh-chaptersectiontitle\">CHAPTER three<\/h5><h2 class=\"ChapterFullwitdh-chaptertitle\">Website Design and Development Basic Differences<\/h2><\/div><\/div>\n\n\n\n<p>Want to learn more about web design and web development? Here are some additional resources and information. If you have further questions <a href=\"https:\/\/huemor.rocks\/contact\" target=\"_blank\" rel=\"noreferrer noopener\">don&#8217;t hesitate to reach out<\/a>.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Questions about web design and development?<\/h2>\n\n\n\n<p>Here we cover common questions about the differences between web design vs web development.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Which is better web design or web development?<\/h3>\n\n\n\n<p>The terms web design and web development are often used interchangeably, but there is a big difference between the two.<\/p>\n\n\n\n<p>Web design focuses primarily on the visual aspect of the site, making sure it looks good and is easy to navigate. Web developers, on the other hand, focus on the functionality of the site, making sure it works well and can handle any traffic that comes its way.<\/p>\n\n\n\n<p>So which is better: web design or web development?<\/p>\n\n\n\n<p>Ultimately, it comes down to personal preference and what you&#8217;re looking to get out of your career. If you&#8217;re interested in the creative side of things and enjoy working with visuals, then web design may be the route for you. But if you&#8217;re more interested in the technical side of things and like problem-solving, then web development may be a better fit.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Does web design require coding?<\/h3>\n\n\n\n<p>Web design does not require coding, but coding can be very helpful in web design. Coding can help you create dynamic and responsive web pages. It can also help you add features to your web pages that are not possible with HTML alone. However, coding is not essential for web design. There are many web design tools that do not require any coding skills. With these tools, you can still create beautiful and functional web pages.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Can a web developer become a designer?<\/h3>\n\n\n\n<p>A web developer can become a web designer, but it will take some effort. A web developer has the technical skills to build websites, while a web designer focuses on the look and feel of the site. To make the transition from developer to designer, you&#8217;ll need to improve your visual design skills and learn how to think like a user. It&#8217;s also important to have a strong understanding of web design principles such as layout, color, and typography. The best way to learn these skills is through formal education or training programs. However, it is also possible to learn these skills on your own through online resources and tutorials.<\/p>\n\n\n\n<p><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Further Reading on Website Design and Website Development.<\/h2>\n\n\n\n<p>Looking for additional resources to better understand web design vs web development? These articles should help.<\/p>\n\n\n\n<ul>\n<li><a href=\"https:\/\/huemor.rocks\/blog\/6-essentials-ecommerce-conversions\/\" target=\"_blank\" rel=\"noreferrer noopener\">Design Essentials for Ecommerce Conversion<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/huemor.rocks\/blog\/how-to-fix-bad-website-designs\/\" target=\"_blank\" rel=\"noreferrer noopener\">Ways to Improve Bad Website Design<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/huemor.rocks\/blog\/website-design-standards\/\" target=\"_blank\" rel=\"noreferrer noopener\">Basic Website Design Principles<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/huemor.rocks\/blog\/key-ui-ux-terms\/\" target=\"_blank\" rel=\"noreferrer noopener\">Common UI\/UX Terms Used by Web Designers<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/huemor.rocks\/blog\/top-saas-website-examples\/\" target=\"_blank\" rel=\"noreferrer noopener\">20 Examples of Top Strategic SaaS Website Design<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/huemor.rocks\/blog\/website-launch-checklist\/\" target=\"_blank\" rel=\"noreferrer noopener\">Website Launch Checklist Essentials<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/huemor.rocks\/blog\/how-can-a-proper-ux-research-process-enhance-product-metrics\/\" target=\"_blank\" rel=\"noreferrer noopener\">How Can A Proper UX Research Process Enhance Product Metrics?<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/huemor.rocks\/blog\/100-ecommerce-web-design-tips-to-skyrocket-sales\/\" target=\"_blank\" rel=\"noreferrer noopener\">Ecommerce Web Design Tips You Need to Boost Sales<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/huemor.rocks\/blog\/how-to-create-a-compelling-case-study\/\" target=\"_blank\" rel=\"noreferrer noopener\">How To Create a Compelling Case Study<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/huemor.rocks\/blog\/service-page-design-examples\/\" target=\"_blank\" rel=\"noreferrer noopener\">The Best Service Page Design Examples<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/huemor.rocks\/blog\/how-to-switch-web-design-agencies\/\" target=\"_blank\" rel=\"noreferrer noopener\">How to Choose Your New Web Design Agency<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/huemor.rocks\/blog\/careers-page-design\/\" target=\"_blank\" rel=\"noreferrer noopener\">How To Create A Careers Page Design That Attracts Talent<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/huemor.rocks\/blog\/great-website-examples\/\" target=\"_blank\" rel=\"noreferrer noopener\">24 Great Website Examples for 2022<\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Trying to figure out the difference between web design vs web development? Learn about the skill sets involved in each, what they entail, and how they work together to create a website.<\/p>\n","protected":false},"author":9,"featured_media":43183,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"content-type":""},"categories":[33,35],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v20.9 (Yoast SEO v20.13) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Understanding Web Design Vs Web Development - Jorban<\/title>\n<meta name=\"description\" content=\"Trying to figure out the difference between web design vs web development? Learn about the skill sets involved in each, what they entail, and how they work together to create a website.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/huemor.rocks\/blog\/web-design-vs-web-development\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Understanding Web Design Vs Web Development - Jorban\" \/>\n<meta property=\"og:description\" content=\"Trying to figure out the difference between web design vs web development? Learn about the skill sets involved in each, what they entail, and how they work together to create a website.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/huemor.rocks\/blog\/web-design-vs-web-development\/\" \/>\n<meta property=\"og:site_name\" content=\"Huemor\" \/>\n<meta property=\"article:published_time\" content=\"2017-12-18T17:35:10+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-07-11T20:08:57+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/huemor.rocks\/wp-content\/uploads\/2017\/12\/2023.06.22.Understanding-Web-Design-Vs-Web-Development.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1025\" \/>\n\t<meta property=\"og:image:height\" content=\"867\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Ahmad Jorban\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@HuemorDesigns\" \/>\n<meta name=\"twitter:site\" content=\"@HuemorDesigns\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Ahmad Jorban\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/huemor.rocks\/blog\/web-design-vs-web-development\/\",\"url\":\"https:\/\/huemor.rocks\/blog\/web-design-vs-web-development\/\",\"name\":\"Understanding Web Design Vs Web Development - Jorban\",\"isPartOf\":{\"@id\":\"https:\/\/huemor.rocks\/#website\"},\"datePublished\":\"2017-12-18T17:35:10+00:00\",\"dateModified\":\"2023-07-11T20:08:57+00:00\",\"author\":{\"@id\":\"https:\/\/huemor.rocks\/#\/schema\/person\/de86670ca16bf41a35b3f0c914f75893\"},\"description\":\"Trying to figure out the difference between web design vs web development? Learn about the skill sets involved in each, what they entail, and how they work together to create a website.\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/huemor.rocks\/blog\/web-design-vs-web-development\/\"]}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/huemor.rocks\/#website\",\"url\":\"https:\/\/huemor.rocks\/\",\"name\":\"Huemor\",\"description\":\"Award-Winning Web Agency, based in USA\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/huemor.rocks\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/huemor.rocks\/#\/schema\/person\/de86670ca16bf41a35b3f0c914f75893\",\"name\":\"Ahmad Jorban\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/huemor.rocks\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/12f6535a8d7adc5a7ffc81ec45a5f070?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/12f6535a8d7adc5a7ffc81ec45a5f070?s=96&d=mm&r=g\",\"caption\":\"Ahmad Jorban\"},\"description\":\"Ahmad Jorban is the President of Jorbanwhere he helps plan the long-term strategic growth of the agency. Jeff is passionate about UI\/UX, demand generation, and digital strategy.\",\"sameAs\":[\"https:\/\/www.linkedin.com\/in\/jeffrey-gapinski\/\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Understanding Web Design Vs Web Development - Jorban","description":"Trying to figure out the difference between web design vs web development? Learn about the skill sets involved in each, what they entail, and how they work together to create a website.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/huemor.rocks\/blog\/web-design-vs-web-development\/","og_locale":"en_US","og_type":"article","og_title":"Understanding Web Design Vs Web Development - Jorban","og_description":"Trying to figure out the difference between web design vs web development? Learn about the skill sets involved in each, what they entail, and how they work together to create a website.","og_url":"https:\/\/huemor.rocks\/blog\/web-design-vs-web-development\/","og_site_name":"Huemor","article_published_time":"2017-12-18T17:35:10+00:00","article_modified_time":"2023-07-11T20:08:57+00:00","og_image":[{"width":1025,"height":867,"url":"https:\/\/huemor.rocks\/wp-content\/uploads\/2017\/12\/2023.06.22.Understanding-Web-Design-Vs-Web-Development.jpg","type":"image\/jpeg"}],"author":"Ahmad Jorban","twitter_card":"summary_large_image","twitter_creator":"@HuemorDesigns","twitter_site":"@HuemorDesigns","twitter_misc":{"Written by":"Ahmad Jorban","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/huemor.rocks\/blog\/web-design-vs-web-development\/","url":"https:\/\/huemor.rocks\/blog\/web-design-vs-web-development\/","name":"Understanding Web Design Vs Web Development - Jorban","isPartOf":{"@id":"https:\/\/huemor.rocks\/#website"},"datePublished":"2017-12-18T17:35:10+00:00","dateModified":"2023-07-11T20:08:57+00:00","author":{"@id":"https:\/\/huemor.rocks\/#\/schema\/person\/de86670ca16bf41a35b3f0c914f75893"},"description":"Trying to figure out the difference between web design vs web development? Learn about the skill sets involved in each, what they entail, and how they work together to create a website.","inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/huemor.rocks\/blog\/web-design-vs-web-development\/"]}]},{"@type":"WebSite","@id":"https:\/\/huemor.rocks\/#website","url":"https:\/\/huemor.rocks\/","name":"Huemor","description":"Award-Winning Web Agency, based in USA","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/huemor.rocks\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/huemor.rocks\/#\/schema\/person\/de86670ca16bf41a35b3f0c914f75893","name":"Ahmad Jorban","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/huemor.rocks\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/12f6535a8d7adc5a7ffc81ec45a5f070?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/12f6535a8d7adc5a7ffc81ec45a5f070?s=96&d=mm&r=g","caption":"Ahmad Jorban"},"description":"Ahmad Jorban is the President of Jorbanwhere he helps plan the long-term strategic growth of the agency. Jeff is passionate about UI\/UX, demand generation, and digital strategy.","sameAs":["https:\/\/www.linkedin.com\/in\/jeffrey-gapinski\/"]}]}},"_links":{"self":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/posts\/36249"}],"collection":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/comments?post=36249"}],"version-history":[{"count":1,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/posts\/36249\/revisions"}],"predecessor-version":[{"id":42457,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/posts\/36249\/revisions\/42457"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/media\/43183"}],"wp:attachment":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/media?parent=36249"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/categories?post=36249"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/tags?post=36249"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}