{"id":40443,"date":"2023-05-18T19:06:00","date_gmt":"2023-05-18T19:06:00","guid":{"rendered":"https:\/\/huemor.rocks\/?p=40443"},"modified":"2023-08-15T12:59:41","modified_gmt":"2023-08-15T12:59:41","slug":"website-redesign-timeline","status":"publish","type":"post","link":"https:\/\/huemor.rocks\/blog\/website-redesign-timeline\/","title":{"rendered":"Website Redesign Timeline: What to Expect"},"content":{"rendered":"\n<p>Whether you’re undergoing a website redesign for your business or launching a new product, the timeline to bring the idea to fruition can be daunting.&nbsp;<\/p>\n\n\n\n<p>Just ask the Wright Brothers, who spent four years designing and building their first airplane. They had plenty of highs and lows throughout their journey, but in 1903 they made history when they flew at Kitty Hawk.<\/p>\n\n\n\n<p>Today, businesses have access to technology, making creating products and launching websites much more accessible than ever. But while timelines may be shorter than ever, many steps are still involved in bringing an idea to life online.&nbsp;<\/p>\n\n\n\n<p>Let’s discuss what you should expect and how working with a web designer helps you through the inevitable bumps in the road.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-website-redesign-goals-and-benefits\">Website Redesign Goals and Benefits<\/h2>\n\n\n\n<p>Aside from asking&nbsp;<a href=\"https:\/\/huemor.rocks\/blog\/website-cost-guide\/\">how much a redesign costs<\/a>, we often receive this other question a lot: how long does a website redesign project take? The short answer is that the timeline depends on your project goals. A complete overhaul of an existing website with many custom features, integrations, and content will take more time than simply creating new visuals for a landing page.<\/p>\n\n\n\n<p>Most companies&nbsp;<a href=\"https:\/\/huemor.rocks\/blog\/how-to-fix-bad-website-designs\/\">redesign their website<\/a>&nbsp;as part of a larger business strategy. Their goals might be:<\/p>\n\n\n\n<ul>\n<li>Create a better user experience<\/li>\n\n\n\n<li>Generate more leads and sales<\/li>\n\n\n\n<li>Improve SEO rankings<\/li>\n\n\n\n<li>Enhance content marketing efforts<\/li>\n\n\n\n<li>Refresh the website’s look and feel<\/li>\n<\/ul>\n\n\n\n<p>Whatever the goal is, it’s essential to have clear objectives that are achievable within your timeline. Some of these goals take a long time to achieve on their own, so be realistic about your expectations based on the goals you have in mind.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-growth-driven-design-process\">Growth-driven Design Process<\/h2>\n\n\n\n<p>While some websites can be designed, developed, and launched in weeks, most projects require more careful planning. That’s why many companies turn to <a href=\"https:\/\/www.growthdrivendesign.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">growth-driven design<\/a> (GDD) as an effective solution for website redesign.<\/p>\n\n\n\n<p><a href=\"https:\/\/www.impactplus.com\/blog\/whats-growth-driven-design\" target=\"_blank\" rel=\"noreferrer noopener\">Growth-driven design<\/a> is a process that starts with creating a minimum viable product (MVP), or the basic functionality and design of the website. From there, the design is constantly iterated based on real-time data, such as:<\/p>\n\n\n\n<ul>\n<li>User Feedback<\/li>\n\n\n\n<li>Analytics<\/li>\n\n\n\n<li>A\/B Testing<\/li>\n<\/ul>\n\n\n\n<p>This process allows for continuous improvements over time that help achieve the desired goals quicker than with a traditional redesign. Further, since the website is being improved gradually, companies can also cut down on their costs as it eliminates the need for a massive overhaul at one time.<\/p>\n\n\n\n<p>Here at Jorban, we employ a GDD strategy for every website redesign project. In a nutshell, we go through extensive onboarding, gathering as much information as possible, designing your website, and implementing real-time improvement strategies throughout the project.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-website-redesign-timeline\">Website Redesign Timeline<\/h2>\n\n\n\n<p>A typical website redesign timeline with Jorbantakes around four to six months, although it can vary based on the complexity of your project. The timeline usually looks something like this.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-strategy-session\">Strategy Session<\/h3>\n\n\n\n<p>The first thing you’ll do with our web design agency is figure out your strategy and goals. This includes researching competitors, analyzing customer feedback, and ensuring the website aligns with your brand identity.<\/p>\n\n\n\n<p>Your&nbsp;<a href=\"https:\/\/huemor.rocks\/services\/\">web design team<\/a>&nbsp;submits a proposal outlining your project’s timeline, deliverables, and cost. Sometimes, this also includes a wireframe or creative brief. After both sides agree on the details, you’ll sign a contract with your web design team. Your contract should include the following elements:<\/p>\n\n\n\n<ul>\n<li><strong>Scope of Work:<\/strong>&nbsp;Definition of the project goals and objectives and what elements will be included in the website design process.<\/li>\n\n\n\n<li><strong>Timeline:<\/strong>&nbsp;The timeline for completing the web design project, including significant milestones and any dependencies between tasks and their estimated duration.<\/li>\n\n\n\n<li><strong>Cost Breakdown:<\/strong>&nbsp;A breakdown of costs associated with each stage of the web design project, such as hosting or graphic designing services.<\/li>\n\n\n\n<li><strong>Rights and Ownership:<\/strong>&nbsp;Details on who owns which rights over creative materials produced during the process (graphics, videos, etc.).<\/li>\n\n\n\n<li><strong>Payment Terms and Conditions:<\/strong>&nbsp;Agreement on payment terms, including payment schedule and method(s) accepted by both parties (e-check\/credit card\/cash).<\/li>\n\n\n\n<li><strong>Termination Clause:<\/strong>&nbsp;If either party would like to terminate early from a contract, they should clarify this ahead of time so there are no misunderstandings when it comes time to end things officially down the line if needed.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-project-kickoff\">Project Kickoff<\/h3>\n\n\n\n<p>Once you get your contract signed, you’ll attend a series of meetings with your web design team to get to the nitty-gritty details of your website redesign. This is the time to get really clear on what you want from your website and&nbsp;<a href=\"https:\/\/huemor.rocks\/blog\/website-redesign-project-plan\/\">devise a plan<\/a>&nbsp;for how to make it happen.<\/p>\n\n\n\n<p>Your project kickoff should be extensive since you’ll be mapping out the entire website redesign process.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-meeting-1-meet-the-team-project-alignment\">Meeting 1: Meet the Team + Project Alignment<\/h4>\n\n\n\n<p>Ideally, your first meeting should be a meet-and-greet with the team working on your website. You should also discuss your expectations, goals, and possible risks associated with your web design project so you and your team are on the same page.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-meeting-2-brand-discovery\">Meeting 2: Brand Discovery<\/h4>\n\n\n\n<p>Your next meeting’s discussion primarily focuses on exploring your brand and developing a plan for how to incorporate it into the web design. This meeting involves researching your market and target audience, so you can decide on a tone and style that will best appeal to them.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-meeting-3-site-architecture\">Meeting 3: Site Architecture<\/h4>\n\n\n\n<p>Now that you have a good idea of what your website should look like, it’s time to start thinking about its structure. This meeting involves sketching out the layout and flow of your website so that it’s easy to access different pages and sections. You’ll also develop your site’s revamped navigation system and how you want to organize the content.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-meeting-4-page-intentions\">Meeting 4: Page Intentions<\/h4>\n\n\n\n<p>Your website isn’t just your homepage. You’ll also need to figure out what content and features you want each page to have. This involves deciding on the types of calls-to-action, forms, images, and other interactive elements that will make your website more engaging.<\/p>\n\n\n\n<p>Other pages of your website typically include:<\/p>\n\n\n\n<ul>\n<li>About page<\/li>\n\n\n\n<li>Contact page<\/li>\n\n\n\n<li>Blog page<\/li>\n\n\n\n<li>Other pages depending on how you decide to structure your site<\/li>\n<\/ul>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-meeting-5-brandscript-voice\">Meeting 5: Brandscript + Voice<\/h4>\n\n\n\n<p>Another critical thing to consider when starting your project would be your brandscript. Your brandscript is a document that outlines the overall feel of your website, from its visual language to how you want it to sound when users visit.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-meeting-6-website-inspiration\">Meeting 6: Website Inspiration<\/h4>\n\n\n\n<p>Reinventing the wheel isn’t always necessary. You can look for existing websites with features you like and incorporate them into your design as long as they fit with the overall vision for your project. This meeting involves researching similar website designs to get inspired and develop a unique web design plan that stands out from the competition.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-stakeholder-interviews\">Stakeholder Interviews<\/h4>\n\n\n\n<p>Your project&nbsp;<a href=\"https:\/\/huemor.rocks\/blog\/how-to-convince-leadership-to-redesign-the-website\/\">involves more stakeholders<\/a>&nbsp;than you may realize. It’s essential to involve everyone that the website redesign affects, such as marketing managers and content writers. Interviewing stakeholders helps you better understand what they need from your website design so that you can incorporate their suggestions into your project plan.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-discovery\">Discovery<\/h3>\n\n\n\n<p>This stage of the website redesign timeline synthesizes everything you’ve done from previous meetings, stakeholder interviews, and research. This is the time to sort through all of your information, iron out any possible kinks in your plan, and determine what will be included in the website’s design.<\/p>\n\n\n\n<p>Here, you’ll discuss project takeaways and create a sitemap to figure out the structure of your website. You’ll also plan user flows and journeys throughout your website and identify any potential areas that might need extra attention.<\/p>\n\n\n\n<p>Analyzing how your competition does these three things also helps with the discovery process.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-creative\">Creative<\/h3>\n\n\n\n<p>Here’s the fun part! Now that you have a well-researched plan for your website design, it’s time to bring it to life. This phase is divided into four smaller steps.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-wireframes\">Wireframes<\/h4>\n\n\n\n<p>Wireframes are your blueprints for your website’s design. They help you map out the structure and layout of your web pages and how a user can interact with them.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-moodboards\">Moodboards<\/h4>\n\n\n\n<p>Another crucial step in the creative process of website design is creating moodboards. Think of your moodboard as a visual representation of your project’s spirit and personality. It includes:<\/p>\n\n\n\n<ul>\n<li>Images<\/li>\n\n\n\n<li>Colors<\/li>\n\n\n\n<li>Fonts<\/li>\n\n\n\n<li>Graphics<\/li>\n\n\n\n<li>Other elements that could be incorporated into your website design<\/li>\n<\/ul>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-transition-from-wireframes-into-hi-fi\">Transition From Wireframes Into Hi-Fi<\/h4>\n\n\n\n<p>Before we go any further, we need to decide on a design direction. This is where the transition from wireframes into high-fidelity mockups comes in. Hi-fi mocks are a visual representation of what your website will look like after it’s fully developed and ready for launch.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-high-fidelity-hi-fi-designs\">High-Fidelity (Hi-Fi) Designs<\/h4>\n\n\n\n<p>After you create hi-fi mockups, it’s time to design the actual look of your website. In this phase, we’ll start building our web pages and applying all of the elements from our moodboard to the pages.<\/p>\n\n\n\n<p>This includes selecting colors for backgrounds or buttons, creating animations for interactive objects, and selecting fonts for headings and body copy.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-seo\">SEO<\/h3>\n\n\n\n<p>Website redesigns should also include a review of your SEO strategy. The goal is to ensure that the website follows all of the best practices for SEO and has been optimized for search engine crawlers.<\/p>\n\n\n\n<p>In this stage, you’ll conduct keyword discovery when you determine which keywords to target for SEO optimization. You’ll also analyze your URLs, page titles, and meta descriptions to ensure they meet SEO standards.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-copywriting\">Copywriting<\/h3>\n\n\n\n<p>Put your keywords to work with copywriting. This is the process of crafting persuasive and educational content for your website. Copywriters must focus on finding a balance between appealing to users, optimizing for search engines, and providing value.<\/p>\n\n\n\n<p>Conducting a copywriting exercise means you have to review the existing copy on your website and create new content where necessary.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"h-copywriting-direction-document\">Copywriting Direction Document<\/h4>\n\n\n\n<p>When redesigning your website, you’ll probably work with a team of writers. That’s why it’s crucial to create a document that everyone can use when writing your website copy.<\/p>\n\n\n\n<p>This copywriting direction document identifies pages that need new copy, outlines the required content type (e.g., FAQs or product descriptions), and explains the writing style to use.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-asset-sourcing\">Asset Sourcing<\/h3>\n\n\n\n<p>The next stage in the website redesign timeline is finding or creating your website assets, such as illustrations, images, and videos. You can ask your web design team if they’re developing assets in-house or sourcing these assets for you. Of course, your creative input is also welcomed at this stage. You can suggest inspirations for the assets you have in mind and let your team work their magic.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-development\">Development<\/h3>\n\n\n\n<p>Now that everything’s collected, designed, and ready to go, it’s time for the development process. This is where all of your website design elements come together.<\/p>\n\n\n\n<p>Your web design team builds the site structure with HTML, CSS, and JavaScript. They’ll take care of integrating plugins, creating custom animations, and optimizing content for search engine crawlers.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-quality-assurance\">Quality Assurance<\/h3>\n\n\n\n<p>Before you can even think about launching, you have to test your website. This is the quality assurance phase, and it’s vital for website redesigns since there are so many moving parts that need to be tested.<\/p>\n\n\n\n<p>Your web design team tests all links, animations, and features to ensure they work correctly before launch. They’ll fix all the quirks and bugs that might pop up.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"h-launch\">Launch<\/h3>\n\n\n\n<p>After months of hard work, the development team has created a website that your business is proud of. It’s time to launch!<\/p>\n\n\n\n<p>Your web design team conducts one last review to ensure everything is perfect, and then they’ll push the website live. You can now show off your brand-new look online and enjoy all its benefits.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-post-launch-and-website-maintenance\">Post Launch and Website Maintenance<\/h2>\n\n\n\n<p>Even after the launch, your website is a constantly evolving asset that needs regular maintenance to keep running smoothly.<\/p>\n\n\n\n<p>The best web design agencies include ongoing maintenance and support just in case anything goes wrong with your website after launch. This means they’ll continue to monitor your website’s quality in terms of the following:<\/p>\n\n\n\n<ul>\n<li>SEO<\/li>\n\n\n\n<li>Technical aspects like speed and structure<\/li>\n\n\n\n<li>User experience<\/li>\n<\/ul>\n\n\n\n<p>Ongoing&nbsp;<a href=\"https:\/\/huemor.rocks\/services\/website-support\/\">support and maintenance retainers<\/a>&nbsp;like Jorbanare essential in keeping your website updated and running efficiently.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"h-build-beautiful-websites-with-huemor\">Build Beautiful Websites With Jorban<\/h2>\n\n\n\n<p>The website redesign timeline can often take longer than you might expect because it’s pretty extensive, but building a beautiful and successful website is worth it.<\/p>\n\n\n\n<p>Jorbanis the perfect partner to help you create stunning websites with quick turnaround times. Our experienced web design team will help guide you through the process — from conception and copywriting to development and launch — ensuring that your website stands out from the competition.<\/p>\n\n\n\n<p><a href=\"https:\/\/huemor.rocks\/contact\/\">Meet with a web design expert<\/a>, and let’s kick off your redesign journey today.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Whether you’re undergoing a website redesign for your business or launching a new product, the timeline to bring the idea to fruition can be daunting.&nbsp; Just ask the Wright Brothers, who spent four years designing and building their first airplane. They had plenty of highs and lows throughout their journey, but in 1903 they made&hellip;<\/p>\n","protected":false},"author":9,"featured_media":43099,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"content-type":""},"categories":[33],"tags":[],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v20.9 (Yoast SEO v20.13) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Website Redesign Timeline: What to Expect - Jorban<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/huemor.rocks\/blog\/website-redesign-timeline\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Website Redesign Timeline: What to Expect - Jorban\" \/>\n<meta property=\"og:description\" content=\"Whether you’re undergoing a website redesign for your business or launching a new product, the timeline to bring the idea to fruition can be daunting.&nbsp; Just ask the Wright Brothers, who spent four years designing and building their first airplane. They had plenty of highs and lows throughout their journey, but in 1903 they made&hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/huemor.rocks\/blog\/website-redesign-timeline\/\" \/>\n<meta property=\"og:site_name\" content=\"Huemor\" \/>\n<meta property=\"article:published_time\" content=\"2023-05-18T19:06:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-08-15T12:59:41+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/huemor.rocks\/wp-content\/uploads\/2023\/05\/2023.05.25.Website-Redesign-Timeline-What-to-Expect.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1025\" \/>\n\t<meta property=\"og:image:height\" content=\"867\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Ahmad Jorban\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@HuemorDesigns\" \/>\n<meta name=\"twitter:site\" content=\"@HuemorDesigns\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Ahmad Jorban\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/huemor.rocks\/blog\/website-redesign-timeline\/\",\"url\":\"https:\/\/huemor.rocks\/blog\/website-redesign-timeline\/\",\"name\":\"Website Redesign Timeline: What to Expect - Jorban\",\"isPartOf\":{\"@id\":\"https:\/\/huemor.rocks\/#website\"},\"datePublished\":\"2023-05-18T19:06:00+00:00\",\"dateModified\":\"2023-08-15T12:59:41+00:00\",\"author\":{\"@id\":\"https:\/\/huemor.rocks\/#\/schema\/person\/de86670ca16bf41a35b3f0c914f75893\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/huemor.rocks\/blog\/website-redesign-timeline\/\"]}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/huemor.rocks\/#website\",\"url\":\"https:\/\/huemor.rocks\/\",\"name\":\"Huemor\",\"description\":\"Award-Winning Web Agency, based in USA\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/huemor.rocks\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/huemor.rocks\/#\/schema\/person\/de86670ca16bf41a35b3f0c914f75893\",\"name\":\"Ahmad Jorban\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/huemor.rocks\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/12f6535a8d7adc5a7ffc81ec45a5f070?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/12f6535a8d7adc5a7ffc81ec45a5f070?s=96&d=mm&r=g\",\"caption\":\"Ahmad Jorban\"},\"description\":\"Ahmad Jorban is the President of Jorbanwhere he helps plan the long-term strategic growth of the agency. Jeff is passionate about UI\/UX, demand generation, and digital strategy.\",\"sameAs\":[\"https:\/\/www.linkedin.com\/in\/jeffrey-gapinski\/\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Website Redesign Timeline: What to Expect - Jorban","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/huemor.rocks\/blog\/website-redesign-timeline\/","og_locale":"en_US","og_type":"article","og_title":"Website Redesign Timeline: What to Expect - Jorban","og_description":"Whether you’re undergoing a website redesign for your business or launching a new product, the timeline to bring the idea to fruition can be daunting.&nbsp; Just ask the Wright Brothers, who spent four years designing and building their first airplane. They had plenty of highs and lows throughout their journey, but in 1903 they made&hellip;","og_url":"https:\/\/huemor.rocks\/blog\/website-redesign-timeline\/","og_site_name":"Huemor","article_published_time":"2023-05-18T19:06:00+00:00","article_modified_time":"2023-08-15T12:59:41+00:00","og_image":[{"width":1025,"height":867,"url":"https:\/\/huemor.rocks\/wp-content\/uploads\/2023\/05\/2023.05.25.Website-Redesign-Timeline-What-to-Expect.jpg","type":"image\/jpeg"}],"author":"Ahmad Jorban","twitter_card":"summary_large_image","twitter_creator":"@HuemorDesigns","twitter_site":"@HuemorDesigns","twitter_misc":{"Written by":"Ahmad Jorban","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/huemor.rocks\/blog\/website-redesign-timeline\/","url":"https:\/\/huemor.rocks\/blog\/website-redesign-timeline\/","name":"Website Redesign Timeline: What to Expect - Jorban","isPartOf":{"@id":"https:\/\/huemor.rocks\/#website"},"datePublished":"2023-05-18T19:06:00+00:00","dateModified":"2023-08-15T12:59:41+00:00","author":{"@id":"https:\/\/huemor.rocks\/#\/schema\/person\/de86670ca16bf41a35b3f0c914f75893"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/huemor.rocks\/blog\/website-redesign-timeline\/"]}]},{"@type":"WebSite","@id":"https:\/\/huemor.rocks\/#website","url":"https:\/\/huemor.rocks\/","name":"Huemor","description":"Award-Winning Web Agency, based in USA","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/huemor.rocks\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/huemor.rocks\/#\/schema\/person\/de86670ca16bf41a35b3f0c914f75893","name":"Ahmad Jorban","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/huemor.rocks\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/12f6535a8d7adc5a7ffc81ec45a5f070?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/12f6535a8d7adc5a7ffc81ec45a5f070?s=96&d=mm&r=g","caption":"Ahmad Jorban"},"description":"Ahmad Jorban is the President of Jorbanwhere he helps plan the long-term strategic growth of the agency. Jeff is passionate about UI\/UX, demand generation, and digital strategy.","sameAs":["https:\/\/www.linkedin.com\/in\/jeffrey-gapinski\/"]}]}},"_links":{"self":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/posts\/40443"}],"collection":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/users\/9"}],"replies":[{"embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/comments?post=40443"}],"version-history":[{"count":2,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/posts\/40443\/revisions"}],"predecessor-version":[{"id":43677,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/posts\/40443\/revisions\/43677"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/media\/43099"}],"wp:attachment":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/media?parent=40443"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/categories?post=40443"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/tags?post=40443"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}