{"id":39145,"date":"2023-05-04T13:49:31","date_gmt":"2023-05-04T13:49:31","guid":{"rendered":"https:\/\/huemor.rocks\/?page_id=39145"},"modified":"2023-08-10T18:29:18","modified_gmt":"2023-08-10T18:29:18","slug":"website-cost-calculator","status":"publish","type":"page","link":"https:\/\/huemor.rocks\/website-cost-calculator\/","title":{"rendered":"Project Calculator"},"content":{"rendered":"\n\n\t\t\t\t<img decoding=\"async\" loading=\"lazy\" src=\"https:\/\/huemor.rocks\/wp-content\/uploads\/2023\/02\/solar-system.png\" alt=\"solar system\" itemprop=\"image\" height=\"58\" width=\"58\" title=\"solar system\" onerror=\"this.style.display='none'\"  \/>\n<h1>\n\t\tWebsite Cost Calculator\n\t<\/h1>\n<h2>\n\t\tinstant website cost estimate.\n\t<\/h2>\n\t<p>Curious about what it might cost to have your website built by the Hue-Crew? Get your custom website cost estimate in less than 2 minutes.<\/p>\n\t<p>*This calculator is geared towards estimating full web projects. If you&#8217;re interested in learning more about the cost of supporting your existing website, <a href=\"https:\/\/huemor.rocks\/contact\">contact us.<\/a><\/p>\n\t\t\t\t<img decoding=\"async\" loading=\"lazy\" src=\"https:\/\/huemor.rocks\/wp-content\/uploads\/2023\/02\/solar-system.png\" alt=\"solar system\" itemprop=\"image\" height=\"58\" width=\"58\" title=\"solar system\" onerror=\"this.style.display='none'\"  \/>\n\t<p>Key Resources<\/p>\n<h2>\n\t\tHow Much Does A Website Cost In 2023?\n\t<\/h2>\n\t<p>You&#8217;re going to be disappointed by this answer, but here&#8217;s the truth: <em>it depends<\/em>.<\/p>\n<p>There is no 1-size-fits-all price for websites. The needs of your business will weigh heavily on the functionality of the website, and with hundreds of variables, the price is bound to fluctuate.<\/p>\n<p>&nbsp;<\/p>\n<h3>A Website Is Your Digital Home<\/h3>\n<p>A great comparison can be made between buying\/building a new home and custom website costs.<\/p>\n<p>For example, a 2,000 sq ft home in San Francisco will cost more than the same size in Charleston. Similarly, a 5,000 sq ft home in the same will have a higher average cost than 1,500 sqft.<\/p>\n<p>The same principle applies to a website, and here are more aspects to consider:<\/p>\n<ul>\n<li><strong>Square Feet = Page Count:<\/strong> Much like how the square feet dictate the space available in a property, the page count limits the amount of content you can add to your website.<\/li>\n<li><strong>Features\/Layouts = Integrations\/Complexity:<\/strong> Pools, outdoor areas, and security additions in a house are equivalent to carts, analytics, and live chat features on a website.<\/li>\n<li><strong>Finishes = Design and Assets:<\/strong> Hardwood floors? High-vaulted ceilings? These finishes can be compared to the visual design, navigation, and typography of your website.<\/li>\n<li><strong>Location = Company Size and Maturity:<\/strong> Properties in in-demand locations are more expensive. The same goes for an established business, which expects more traffic and conversions.<\/li>\n<\/ul>\n\t<h2>Before We Talk Website Cost, Let&#8217;s Understand Your Goals And Preferences<\/h2>\n<p>&nbsp;<\/p>\n<h3>What Do You Want The Website To Accomplish?<\/h3>\n<p>The cost of your website will largely depend on what you&#8217;re trying to achieve.<\/p>\n<p>For smaller businesses who want a simple, informational website, you shouldn&#8217;t need to spend a fortune in 2023.<\/p>\n<p>For businesses that want to rely on their website as a major driver in sales, recruiting, or education, expect to have to invest more in your website as these goals can be complex, nuanced, and require a lot of added website functionality.<\/p>\n<p>&nbsp;<\/p>\n<h3>Who Do You Want To Work With?<\/h3>\n<p>The cost of labor, especially technical labor is quickly rising globally. On average, a US-based web developer will earn $75,000-$150,000 annually. That means it&#8217;s more expensive now than ever, for agencies to staff these individuals.<\/p>\n<p>If you&#8217;re a US-based company and you want the convenience of working with a US-based agency, expect to pay a higher premium to do so.<\/p>\n<p>By working with an international team, you can potentially lower your average costs by 25-50%. The downside, however, will most likely be strained communication.<\/p>\n<p>&nbsp;<\/p>\n<h3>What Level Of Collaboration Are You Looking For?<\/h3>\n<p>Are you looking for a web agency partner that can do everything for you? Or are you seeking a partner to only execute one aspect of your website project?<\/p>\n<p>If you plan to have an agency partner do everything (customer research, UI\/UX design, full-stack development, database integration, 3rd party-integrations, illustrations, custom graphics, copywriting, search engine optimization, etc.) expect to have a larger team, and in part, expect the website to cost more.<\/p>\n<p>If you&#8217;re comfortable with owning specific aspects of the project and only having the agency partner execute others, then the cost of the project will be far less.<\/p>\n\t<h2>Estimating Your Website Project Cost<\/h2>\n<p>Hopefully, now we&#8217;re on the same page in terms of all of the variations that could weigh on a custom website cost calculator. Moving forward, this next section will be written assuming the following:<\/p>\n<ul>\n<li>You&#8217;re looking for a website that can be used as a viable sales, recruitment, and educational tool<\/li>\n<li>You&#8217;re looking for a partner based in North America or Western Europe<\/li>\n<li>You&#8217;re looking for a partner that can execute the entire project from start to finish, minimizing your involvement<\/li>\n<\/ul>\n<p>All of these things are true for our typical <a href=\"https:\/\/huemor.rocks\/small-business-websites\" target=\"_blank\" rel=\"noopener noreferrer\"><u>mid-market web design<\/u><\/a> customer.<\/p>\n<p>We will notate how within these sections web design costs may be minimized or reduced based on the size and scope of your web designers project.<\/p>\n<p>&nbsp;<\/p>\n<h3>Standard Agency Hourly Rates<\/h3>\n<p>Most US \/ EU-based web development and design agencies will charge $150-$250 per hour for their services. These rates will be the basis of the estimates provided.<\/p>\n<p>&nbsp;<\/p>\n<h3>Customer Research &amp; Discovery Costs<\/h3>\n<p><strong>Cost Estimated: $12,000-$20,000<\/strong><\/p>\n<p>Any agency that wants to create a worthwhile outcome should be incorporating a designated research and discovery phase in their website cost estimate. During this period of time, the agency will do their due diligence to better understand the client&#8217;s business, and their customers. This process will typically take 2-4 weeks to complete.<\/p>\n<p><em>*If you are a small business with a simple site, this step will most likely cost far less than this estimate.<\/em><\/p>\n<strong>Curious about your<\/strong> own web development cost calculator and<strong> design cost?<\/strong><br \/>\n<a href=\"https:\/\/huemor.rocks\/website-cost-calculator#website-cost-calculator\" target=\"_blank\" rel=\"noopener noreferrer\"><u>Use our web design cost calculator.<\/u><\/a>\n<p>&nbsp;<\/p>\n<h3>Website Architecture &amp; Planning Cost<\/h3>\n<p><strong>Cost Estimated: $6,000-$12,000<\/strong><\/p>\n<p>In this stage, your agency partner will plan out the overall structure of your website. This is an important step both from a user experience and search engine optimization standpoint. This process will typically take 1-2 weeks to complete.<\/p>\n<p><em>*If you have a small website with few pages, this step will most likely cost far less than this estimate.<\/em><\/p>\n<strong>Curious about your web design cost?<\/strong><br \/>\n<a href=\"https:\/\/huemor.rocks\/website-cost-calculator#website-cost-calculator\" target=\"_blank\" rel=\"noopener noreferrer\"><u>Use our web design cost calculator.<\/u><\/a>\n<p>&nbsp;<\/p>\n<h3>Web Design Cost<\/h3>\n<p><strong>Cost Estimated: $24,000-$40,000+<\/strong><\/p>\n<p>In this stage, your agency partner will be creating wireframes and prototypes of the website with the anticipation of creating a product that looks like the real deal. This is an area in the web design project where there will be a ton of variability based on the size and complexity of the website. Furthermore, the objective of the user experience itself will dictate website design costs. Highly experiential websites with many moving parts require more design time. The same can be said for complex features that require multiple states and statuses. This process will typically take 8-12 weeks to complete.<\/p>\n<p><em>*If you have a small website with a simple<\/em> responsive design<em>, this step will most likely cost far less than this estimate.<\/em><\/p>\n<strong>Curious about your web design cost?<\/strong><br \/>\n<a href=\"https:\/\/huemor.rocks\/website-cost-calculator#website-cost-calculator\" target=\"_blank\" rel=\"noopener noreferrer\"><u>Use our website<\/u><\/a> web design cost calculator<a href=\"https:\/\/huemor.rocks\/website-cost-calculator#website-cost-calculator\" target=\"_blank\" rel=\"noopener noreferrer\"><u>.<\/u><\/a>\n<p>&nbsp;<\/p>\n<h3>Website Development Cost<\/h3>\n<p><strong>Cost Estimated: $30,000-$50,000<\/strong><\/p>\n<p>In this stage, your agency partner will be taking the items from the previous phase and turning them into functional web pages. This is another area of the project where there can be a lot of flexibility in price based on the objectives of the website. Complicated functionality or user experiences will increase development time, and in turn, increase the total cost of development for the web project. This process will typically take 12-16 weeks to complete.<\/p>\n<p><em>*If you have limited custom functionality, or do not need to have the<\/em> new website be<em> integrated into a CMS, then this step will most likely cost far less than this estimate.<\/em><\/p>\n<strong>Curious about your custom website cost?<\/strong><br \/>\n<a href=\"https:\/\/huemor.rocks\/website-cost-calculator#website-cost-calculator\" target=\"_blank\" rel=\"noopener noreferrer\"><u>Use our website cost calculator.<\/u><\/a>\n<p>&nbsp;<\/p>\n<h3>Copywriting Cost<\/h3>\n<p><strong>Cost Estimated: $12,000-$20,000<\/strong><\/p>\n<p>Writing for a web project is just as in-depth as design planning. Each page must be written both for the ideal customer and the search engine&#8217;s benefit. This process will typically take 2-4 weeks to complete.<\/p>\n<p><em>*If you have the ability to write copy in-house, or have a smaller site, this step will likely cost far less than this estimate.<\/em><\/p>\n<strong>Curious about your custom website cost?<\/strong><br \/>\n<a href=\"https:\/\/huemor.rocks\/website-cost-calculator#website-cost-calculator\" target=\"_blank\" rel=\"noopener noreferrer\"><u>Use our website cost calculator.<\/u><\/a>\n\t<h2>Who Should Invest in Their Website?<\/h2>\n<p>As a general rule in business, you should spend your time, money, and effort on something that will give you a high ROI. You can focus on manufacturing quality goods, streamlining your services, or hiring dependable manpower.<\/p>\n<p>For most, a website is treated as an investment. This is something that customers directly interact with, so you want to put your best foot forward.<\/p>\n<p>However, there are some important considerations before you spend money on a website.<\/p>\n<p>&nbsp;<\/p>\n<h3>A Custom Website Is Not for Bootstrapped Start-ups and Very Small Businesses<\/h3>\n<p>If you&#8217;re just beginning as a company, you might be tempted to get a premium startup website to give off authoritative branding.<\/p>\n<p>On the other hand, a very small business might want a high-end site to provide better customer service to their loyal customers or improve their marketing. But hear us out-investing in a premium website is not a good decision.<\/p>\n<p>The most obvious reason for this is the high costs of building, launching, and maintaining a premium website. Premium themes with complicated functionalities (that your customers will probably not use) will add up to the expense.<\/p>\n<p>For very small businesses, the costs will not lead to high ROI. It will eat up your capital long before it starts to pay off-if it ever does.<\/p>\n<p>Start-ups must also focus on selling their products or services first before trying anything too flashy. It&#8217;s more important to establish your capabilities as it helps create a stronger customer base.<\/p>\n<p>&nbsp;<\/p>\n<h3>A Premium Website Is for Established Businesses and Funded Start-ups<\/h3>\n<p>If your business is earning around $5 million in revenue annually, you can consider yourself an established company. This is the best moment to start investing in a premium professional website as it can help streamline your processes and add to your revenue.<\/p>\n<p>Web design is particularly important for companies that use their website for services, or commerce functionality such as those that sell enterprise software, expensive equipment, or goods directly to customers (which is why good ecommerce store design is integral).<\/p>\n<p>The costs will be justified with the increased engagement with customers, easy tracking of data for reports, and automated integrations including useful premium content management system and plugins. Therefore, a premium website is definitely a worth-it investment that will result in high ROI.<\/p>\n                                                <button data-parent=\"#TableOfContentsAccordion-\" type=\"button\" data-toggle=\"collapse\" data-target=\"#tocOne\" aria-expanded=\"false\" aria-controls=\"tocOne\">\n                            Table of Contents                            <i>Expand<\/i>\n                        <\/button>\n                            <ul id=\"TableOfContents-list-\">\n                            <\/ul>\n                            <button type=\"button\" data-parent=\"#TableOfContentsAccordion-\" data-toggle=\"collapse\" data-target=\"#additional-reading\" aria-expanded=\"false\" aria-controls=\"additional-reading\">\n                                Additional Reading                                <i>Expand<\/i>\n                            <\/button>\n                                <ul>\n                                                                            <li>\n                                            <a href=\"https:\/\/huemor.rocks\/blog\/website-cost-guide\/\" rel=\"noopener\" target=\"\">How Much Does It Cost to Build a Website?                                             <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"https:\/\/huemor.rocks\/blog\/website-redesign-project-plan\/\" rel=\"noopener\" target=\"_self\">A Step-by-Step Website Redesign Project Plan                                            <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"https:\/\/huemor.rocks\/blog\/web-design-system\/\" rel=\"noopener\" target=\"_self\">How to Build a Web Design System                                            <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"https:\/\/huemor.rocks\/blog\/how-can-a-proper-ux-research-process-enhance-product-metrics\/\" rel=\"noopener\" target=\"_self\">Choosing the Right Product Metrics Using UX Research Process                                            <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"https:\/\/huemor.rocks\/blog\/top-retail-website-examples\/\" rel=\"noopener\" target=\"_self\">Our Top Retail Website Examples                                            <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"https:\/\/huemor.rocks\/blog\/web-design-vs-web-development\/\" rel=\"noopener\" target=\"_self\">Understanding Web Design vs Web Development                                            <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"https:\/\/huemor.rocks\/blog\/top-beauty-website-examples\/\" rel=\"noopener\" target=\"_self\">Our Top Beauty Website Examples                                            <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"https:\/\/huemor.rocks\/resource\/shopify-speed-guide-checklist\/\" rel=\"noopener\" target=\"_self\">Our Shopify Speed Guide Checklist                                            <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"\" rel=\"noopener\" target=\"_self\">Guide to Optimizing Shopify Image sizes                                            <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"https:\/\/huemor.rocks\/blog\/service-page-design-examples\/\" rel=\"noopener\" target=\"_self\">Our Service Page Layout Examples                                            <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"https:\/\/huemor.rocks\/blog\/top-saas-website-examples\/\" rel=\"noopener\" target=\"_self\">Best SaaS Websites of 2022                                            <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"https:\/\/huemor.rocks\/blog\/seo-for-a-new-website\/\" rel=\"noopener\" target=\"_self\">New Website SEO Foundations                                            <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"https:\/\/huemor.rocks\/blog\/wordpress-performance-optimization\/\" rel=\"noopener\" target=\"_self\">WordPress Performance Optimization Best Practices                                            <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"https:\/\/huemor.rocks\/blog\/100-ecommerce-web-design-tips-to-skyrocket-sales\/\" rel=\"noopener\" target=\"_self\">100 Ecommerce Website Design Tips                                            <\/a>\n                                        <\/li>\n                                                                                <li>\n                                            <a href=\"https:\/\/huemor.rocks\/blog\/dynamic-website-content\/\" rel=\"noopener\" target=\"_self\">How to Use Dynamic Website Content                                            <\/a>\n                                        <\/li>\n                                <\/ul>\n                <a href=\"https:\/\/huemor.rocks\/contact\/\" target=\"_self\" rel=\"noopener\" role=\"button\">\n                    Book A Strategy Session\n                <\/a>\n\n","protected":false},"excerpt":{"rendered":"<p>Website Cost Calculator instant website cost estimate. Curious about what it might cost to have your website built by the Hue-Crew? Get your custom website cost estimate in less than 2 minutes. *This calculator is geared towards estimating full web projects. If you&#8217;re interested in learning more about the cost of supporting your existing website,&hellip;<\/p>\n","protected":false},"author":1,"featured_media":41141,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"content-type":""},"folder":[82],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v20.9 (Yoast SEO v20.13) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Project Calculator - Jorban<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/huemor.rocks\/website-cost-calculator\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Project Calculator - Jorban\" \/>\n<meta property=\"og:description\" content=\"Website Cost Calculator instant website cost estimate. Curious about what it might cost to have your website built by the Hue-Crew? Get your custom website cost estimate in less than 2 minutes. *This calculator is geared towards estimating full web projects. If you&#8217;re interested in learning more about the cost of supporting your existing website,&hellip;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/huemor.rocks\/website-cost-calculator\/\" \/>\n<meta property=\"og:site_name\" content=\"Huemor\" \/>\n<meta property=\"article:modified_time\" content=\"2023-08-10T18:29:18+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/huemor.rocks\/wp-content\/uploads\/2023\/06\/website-cost-calculator-featured-img-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1025\" \/>\n\t<meta property=\"og:image:height\" content=\"867\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@HuemorDesigns\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/huemor.rocks\/website-cost-calculator\/\",\"url\":\"https:\/\/huemor.rocks\/website-cost-calculator\/\",\"name\":\"Project Calculator - Jorban\",\"isPartOf\":{\"@id\":\"https:\/\/huemor.rocks\/#website\"},\"datePublished\":\"2023-05-04T13:49:31+00:00\",\"dateModified\":\"2023-08-10T18:29:18+00:00\",\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/huemor.rocks\/website-cost-calculator\/\"]}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/huemor.rocks\/#website\",\"url\":\"https:\/\/huemor.rocks\/\",\"name\":\"Huemor\",\"description\":\"Award-Winning Web Agency, based in USA\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/huemor.rocks\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Project Calculator - Jorban","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/huemor.rocks\/website-cost-calculator\/","og_locale":"en_US","og_type":"article","og_title":"Project Calculator - Jorban","og_description":"Website Cost Calculator instant website cost estimate. Curious about what it might cost to have your website built by the Hue-Crew? Get your custom website cost estimate in less than 2 minutes. *This calculator is geared towards estimating full web projects. If you&#8217;re interested in learning more about the cost of supporting your existing website,&hellip;","og_url":"https:\/\/huemor.rocks\/website-cost-calculator\/","og_site_name":"Huemor","article_modified_time":"2023-08-10T18:29:18+00:00","og_image":[{"width":1025,"height":867,"url":"https:\/\/huemor.rocks\/wp-content\/uploads\/2023\/06\/website-cost-calculator-featured-img-1.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_site":"@HuemorDesigns","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/huemor.rocks\/website-cost-calculator\/","url":"https:\/\/huemor.rocks\/website-cost-calculator\/","name":"Project Calculator - Jorban","isPartOf":{"@id":"https:\/\/huemor.rocks\/#website"},"datePublished":"2023-05-04T13:49:31+00:00","dateModified":"2023-08-10T18:29:18+00:00","inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/huemor.rocks\/website-cost-calculator\/"]}]},{"@type":"WebSite","@id":"https:\/\/huemor.rocks\/#website","url":"https:\/\/huemor.rocks\/","name":"Huemor","description":"Award-Winning Web Agency, based in USA","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/huemor.rocks\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"}]}},"_links":{"self":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/pages\/39145"}],"collection":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/comments?post=39145"}],"version-history":[{"count":4,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/pages\/39145\/revisions"}],"predecessor-version":[{"id":43628,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/pages\/39145\/revisions\/43628"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/media\/41141"}],"wp:attachment":[{"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/media?parent=39145"}],"wp:term":[{"taxonomy":"folder","embeddable":true,"href":"https:\/\/huemor.rocks\/wp-json\/wp\/v2\/folder?post=39145"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}